src/src/InformationRegisters/AccountingPolicy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>AccountingPolicy</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>RegisteredForVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostVATEntriesBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PostAdvancePaymentsBySourceDocuments</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ObsoleteUseTaxInvoices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueAutomaticallyAgainstSales</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DefaultVATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATThreshold</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CashMethodOfAccounting</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>InventoryValuationMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InventoryValuationMethods</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnFromCustomer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UseGoodsReturnToSupplier</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/CommonModules/WorkWithVATServerCall/Ext/Module.bsl
#Region ProgramInterface 

Function GetSubordinateTaxInvoice(BasisDocument, Received = False,  Advance = False) Export
	Return WorkWithVAT.GetSubordinateTaxInvoice(BasisDocument, Received,  Advance);
EndFunction

Function CheckForTaxInvoiceUse(Date, Company, Cancel = False) Export
	
	Policy = InformationRegisters.AccountingPolicy.GetAccountingPolicy(Date, Company);
	If Policy.PostVATEntriesBySourceDocuments Then
		CommonUseClientServer.MessageToUser(
			StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Company %1 doesn''t use tax invoices at %2 (specify this option in accounting policy)'"),
				Company,
				Format(Date, "DLF=D")),,,,
			Cancel);
	EndIf;
	
EndFunction

// Check the ability to enter the Advance payment invoice
//
// Parameters:
//	Date - Date - Check date
//	Company - CatalogRef.Companies - Company for check
//	Cancel - Boolean - For cancel posting document
//	
Procedure CheckForAdvancePaymentInvoiceUse(Date, Company, Cancel = False) Export
	
	Policy = InformationRegisters.AccountingPolicy.GetAccountingPolicy(Date, Company);
	If Policy.PostAdvancePaymentsBySourceDocuments Then
		CommonUseClientServer.MessageToUser(
			StringFunctionsClientServer.SubstituteParametersInString(
				NStr("en = 'Company %1 doesn''t use Advance payment invoices at %2 (specify this option in accounting policy)'"),
				Company,
				Format(Date, "DLF=D")),,,,
			Cancel);
	EndIf;
	
EndProcedure

#EndRegion
